#1. Роздрукувати всі парні числа менші 100 (написати два варіанти коду: один використовуючи цикл while, а інший з використанням циклу for).



#2.  Роздрукувати всі непарні числа менші 100. (написати два варіанти коду: один використовуючи оператор continue, а інший без цього оператора).



#3.  Перевірити чи список містить непарні числа.
          #(Підказка: використати оператор break)



#4.  Створити список, який містить елементи цілочисельного типу, потім за допомогою циклу перебору змінити тип даних елементів на числа з плаваючою крапкою. 
#(Підказка: використати вбудовану функцію float ()).

#5.  Вивести числа Фібоначі включно до введеного числа n, використовуючи цикли. (Послідовність чисел Фібоначі 0, 1, 1, 2, 3, 5, 8, 13 і т.д.)


#6.  Створити список, що складається з чотирьох елементів типу string. Потім, за допомогою циклу for, вивести елементи по черзі на екран.


#7.  Змінити попередню програму так, щоб в кінці кожної букви елементів при виводі додавався певний символ, наприклад “#”. 
          #(Підказка: цикл for може бути вкладений в інший цикл, а також  треба використати функцію print(“ ”, end=”%”)).


#8.  Юзер вводить число з клавіатури, написати скріпт, який визначає чи це число просте чи складне.

#10.  Визначити чи введене слово паліндром, тобто чи воно читається однаково зліва направо і навпаки.