# #1. Роздрукувати всі парні числа менші 100 (написати два варіанти коду: один використовуючи цикл while, а інший з використанням циклу for).
pos = 0
while pos < 100:
    print(pos)
    pos+=2

for j in range(2,100,2):
  print (j)

# #2.  Роздрукувати всі непарні числа менші 100. (написати два варіанти коду: один використовуючи оператор continue, а інший без цього оператора).
for num in range(100):
    if num %2 == 0:
        continue
    print(num)


#3.  Перевірити чи список містить непарні числа.
          #(Підказка: використати оператор break)

seq = [0, -2, 3]
for i in seq:
  if i % 2 == 1:
        print(seq[i-1])
        break

#4.  Створити список, який містить елементи цілочисельного типу, потім за допомогою циклу перебору змінити тип даних елементів на числа з плаваючою крапкою. 
#(Підказка: використати вбудовану функцію float ()).

seq = [0, -2, 3]
for i in range(len(seq)):
    seq[i] = float(seq[i])
print(seq)

#5.  Вивести числа Фібоначі включно до введеного числа n, використовуючи цикли. (Послідовність чисел Фібоначі 0, 1, 1, 2, 3, 5, 8, 13 і т.д.)
last = int(input('Введіть кінцеве число послідовності:\n'))
fibo = [0 , 1]
for i in range(2, last + 1):
    fibo.append(fibo[i - 1] + fibo[i - 2])
print(fibo)

#6.  Створити список, що складається з чотирьох елементів типу string. Потім, за допомогою циклу for, вивести елементи по черзі на екран.
seq = ["ddd", "1", "g6"]  
for i in seq:
    print(i)

#7.  Змінити попередню програму так, щоб в кінці кожної букви елементів при виводі додавався певний символ, наприклад “#”. 
          #(Підказка: цикл for може бути вкладений в інший цикл, а також  треба використати функцію print(“ ”, last=”%”)).

seq = ["ddd", "1", "g6"]  
for i in seq:
    print(i + "#")
#8.  Юзер вводить число з клавіатури, написати скріпт, який визначає чи це число просте чи складне.
num = int(input("Enter number: "))
i = 1
s = 0
while i <= num:
    if num % i == 0:
        s += 1
    i = i + 1
if s > 2:
    print("Non prime")    
else:
    print("Prime")    
#10.  Визначити чи введене слово паліндром, тобто чи воно читається однаково зліва направо і навпаки.

word = input("Enter word: ")
def palindrome(word): 
    return word == word[::-1]
print(palindrome(word))